Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 07-Bow-Wow-and-Mew-Mew/CAT/corpus-genesis-ylt.en.utf8.tmx
Source language: en
Languages: chr

source: and she hath said unto me, Both drink thou, and also for thy camels I draw -- she is the woman whom Jehovah hath decided for my lord's son.
chr: ᎯᎠᏃ ᎾᎩᏪᏎᎸᎭ, ᎭᏗᏔ ᏂᎯ, ᎠᎴ ᎾᏍᏉ ᏙᏓᏥᏢᎡᎵ ᎨᎻᎵ ᏗᏣᏤᎵᎦ; ᎾᏍᎩ ᎨᏎᏍᏗ ᎠᎨᏴ ᏱᎰᏩ ᎤᏑᏯᎡᎸᎯ ᎠᎩᏅᏏᏙᎯ ᎤᏪᏥ.

source: 'Before I finish speaking unto my heart, then lo, Rebekah is coming out, and her pitcher on her shoulder, and she goeth down to the fountain, and draweth; and I say unto her, Let me drink, I pray thee,
chr: ᎠᏏᏉᏃ ᏗᏆᏓᏅᏛ ᏂᏥᏁᏦᎲᏍᎬᎾ ᎨᏒᎩ, ᎬᏂᏳᏉ ᎵᏇᎩ ᎤᎷᏨᎩ ᎠᎹ ᎠᏟᏍᏗ ᎤᏃᎭᏝᎲᎩ; ᎠᎹᏃ ᎠᏢᏗᏱ ᎠᏔᎴᏒ ᏭᎦᏐᎠᏒᎩ, ᎠᎴ ᏭᏢᎲᎩ; ᎯᎠᏃ ᏂᏥᏪᏎᎸᎩ, ᎦᏗᏔ.

source: and she hasteth and letteth down her pitcher from off her and saith, Drink, and thy camels also I water; and I drink, and the camels also she hath watered.
chr: ᎤᎵᏍᏗᏳᏃ ᎤᏃᎭᏞᏒᎩ ᎠᎹ ᎠᏢᏗ, ᎠᎴ ᎯᎠ ᏄᏪᏒᎩ, ᎭᏗᏔ, ᎠᎴ ᎾᏍᏉ ᎨᎻᎵ ᏙᏓᎦᏗᏔᏍᏔᏂ; ᎰᏩᏃ ᎠᏆᏗᏔᎲᎩ, ᎠᎴ ᎾᏍᏉ ᎨᎻᎵ ᏚᏗᏔᏍᏔᏅᎩ.

source: 'And I ask her, and say, Whose daughter [art] thou? and she saith, Daughter of Bethuel, son of Nahor, whom Milcah hath borne to him, and I put the ring on her nose, and the bracelets on her hands,
chr: ᎥᏥᏯᏛᏛᏅᎩᏃ ᎯᎠ ᏅᏥᏪᏎᎸᎩ, ᎦᎪ ᎤᏪᏥ ᏂᎯ? ᎯᎠᏃ ᏄᏪᏒᎩ, ᏇᏚᎡᎵ ᎤᏪᏥ, ᎾᏍᎩ ᏁᎰ ᎤᏪᏥ, ᎻˌᎵᎦ ᎤᎾᏄᎪᏫᏎᎸᎯ; ᎠᎴ ᎠᎵᏴᏌᏙᏗ ᎥᏥᏴᏌᏔᏅᎩ, ᎠᎴ ᏗᎵᏰᏠᏍᏗ ᏙᏥᏰᏠᏍᏔᏅᎩ ᏧᏬᏰᏂ.

source: and I bow, and do obeisance before Jehovah, and I bless Jehovah, God of my lord Abraham, who hath led me in the true way to receive the daughter of my lord's brother for his son.
chr: ᎡᎳᏗᏃ ᎾᏆᏛᏁᎸᎩ, ᎠᎴ ᏱᎰᏩ ᎥᏥᏯᏓᏙᎵᏍᏓᏁᎸᎩ, ᎠᎴ ᏥᎸᏉᏔᏅᎩ ᏱᎰᏩ ᎤᏁᎳᏅᎯ ᎠᎩᏅᏏᏙᎯ ᎡᏆᎭᎻ ᎤᏤᎵᎦ, ᎾᏍᎩ ᏚᏳᎪᏛ ᏨᏗᏆᏘᏅᏍᏔᏅ, ᎾᏍᎩ ᎠᎩᏅᏏᏙᎯ ᏗᎾᏓᏅᏟ ᎤᏪᏥ ᎠᎨᏴ ᏥᏯᏘᏅᎡᏗᏱ [ᎠᎩᏅᏏᏙᎯ] ᎤᏪᏥ ᎠᏫᏅ.

source: 'And now, if ye are dealing kindly and truly with my lord, declare to me; and if not, declare to me; and I turn unto the right or unto the left.'
chr: ᎿᏉᏃ ᎢᏳ ᎠᎩᏅᏏᏙᎯ ᎣᏍᏛ ᎠᎴ ᏚᏳᎪᏛ ᏅᏤᏣᏛᏁᎵᏎᏍᏗ, ᏍᎩᏃᎲᏏ; ᎢᏳ ᎠᎴ ᏱᏝ, ᏍᎩᏃᎲᏏ; ᎾᏍᎩ ᏥᎦᏘᏏ ᎠᎴ ᏥᎦᏍᎦᏂ ᎢᏗᏢ ᏩᏆᎪᎸᏍᏙᏗᏱ.

source: And Laban answereth -- Bethuel also -- and they say, 'The thing hath gone out from Jehovah; we are not able to speak unto thee bad or good;
chr: ᎿᏉᏃ ᎴᏆᏂ ᎠᎴ ᏇᏚᎡᎵ ᏧᏂᏁᏤᎢ, ᎯᎠ ᏄᏂᏪᏎᎢ, ᏱᎰᏩ ᎤᏓᏅᏖᎸᎯ ᎯᎠ; ᎥᏝᏃ ᎨᏍᏛᏁᏤᏗ ᏱᎩ ᎤᏲ ᎠᎴ ᎣᏍᏛ.

source: lo, Rebekah [is] before thee, take and go, and she is a wife to thy lord's son, as Jehovah hath spoken.'
chr: ᎬᏂᏳᏉ ᎵᏇᎩ ᎢᎬᏱᏗᏢ ᎤᏬᎳ, ᎯᏯᏘᏄᎦ, ᎠᎴ ᏥᎮᎾ, ᏣᏅᏏᏙᎯᏃ ᎤᏪᏥ ᎤᏓᎵᎢ ᎨᏎᏍᏗ, ᎾᏍᎩᏯ ᏱᎰᏩ ᏄᏪᏒᎢ.

source: And it cometh to pass, when the servant of Abraham hath heard their words, that he boweth himself towards the earth before Jehovah;
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁᎢ, ᎾᏍᎩ ᎡᏆᎭᎻ ᎤᏅᏏᏓᏍᏗ ᎤᏛᎦᏅ ᎠᏂᏁᎬᎢ, ᏱᎰᏩ ᎤᏓᏙᎵᏍᏓᏁᎴᎢ ᎡᎳᏗ ᎢᏗᏢ ᏄᏛᏁᎴᎢ.

source: and the servant taketh out vessels of silver, and vessels of gold, and garments, and giveth to Rebekah; precious things also he hath given to her brother and to her mother.
chr: ᎠᏥᏅᏏᏓᏍᏗᏃ ᏚᎾᏄᎪᏫᏎ ᎠᏣᏅᎩ ᎠᏕᎸ ᎤᏁᎬ ᎠᎴ ᎠᏕᎸ ᏓᎶᏂᎨ ᏗᎪᏢᏔᏅᎯ, ᎠᎴ ᏗᏄᏬ, ᎵᏇᎩᏃ ᏕᎤᏲᎯᏎᎴᎢ; ᎠᎴ ᎾᏍᏉ ᎤᏙ ᎠᎴ ᎤᏥ ᏧᏓᎴᏅᏛ ᏗᎦᎸᏉᏗ ᏚᏁᎴᎢ.

source: And they eat and drink, he and the men who [are] with him, and lodge all night; and they rise in the morning, and he saith, 'Send me to my lord;'
chr: ᎤᎾᎵᏍᏓᏴᏁᏃ ᎠᎴ ᏚᎾᏗᏔᎮᎢ, ᎤᏩᏒ ᎠᎴ ᎠᏂᏍᎦᏯ ᏓᏘᏁᎲᎢ, ᎠᎴ ᎤᏂᏒᎴᎢ. ᏑᎾᎴᏃ ᎤᎾᏗᏓᏁᏎᎢ, ᎠᎴ ᎯᎠ ᏄᏪᏎᎢ, ᏥᏍᎩᏯᏂᎩᏍᏓ ᎠᎩᏅᏏᏙᎯ ᏤᎲᎢ ᏫᏥᎶᎢ.

source: and her brother saith -- her mother also -- 'Let the young person abide with us a week or ten days, afterwards doth she go.'
chr: ᎵᏇᎩᏃ ᏅᏙ ᎠᎴ ᎤᏥ ᎯᎠ ᏄᏂᏪᏎᎢ, ᎠᏏ ᎠᏍᎪᎯ ᎢᏴᏛ ᏧᏒᎯᏛ ᏬᎨᎳᏗᏓ ᎠᏛ; ᎣᏂᏃ ᎩᎳ ᎡᏒᎭ.

source: And he saith unto them, 'Do not delay me, seeing Jehovah hath prospered my way; send me away, and I go to my lord;'
chr: ᎯᎠᏃ ᏂᏚᏪᏎᎸᎩ, ᏞᏍᏗ ᏍᏉᎯᏕᎸᎩ ᎬᏂᏳᏰᏃ ᏱᎰᏩ ᎣᏍᏛ ᎾᏆᏛᏂᏏ ᎨᏙᎲᎢ; ᏥᏍᎩᏯᏂᎩᏍᏓ, ᎠᎩᏅᏏᏙᎯ ᏧᏬᎸ ᏫᏥᎶᎢ.

source: and they say, 'Let us call for the young person, and ask at her mouth;'
chr: ᎯᎠᏃ ᏄᏂᏪᏎᎢ; ᎠᏛ ᏮᏓᏲᏥᏯᏅᎯ, ᎠᎴ ᎾᏍᎩ ᏓᏲᏣᏛᏛᏂ.

source: and they call for Rebekah, and say unto her, 'Dost thou go with this man?' and she saith, 'I go.'
chr: ᎵᏇᎩᏃ ᏭᏂᏯᏅᎮᎢ, ᎠᎴ ᎯᎠ ᏂᎬᏩᏪᏎᎴᎢ; ᏓᏍᏕᏏᏍᎪ ᎯᎠ ᎠᏍᎦᏯ? ᎯᎠᏃ ᏄᏪᏎᎢ; ᏓᎨᏏᏉ.

source: And they send away Rebekah their sister, and her nurse, and Abraham's servant, and his men;
chr: ᎤᎾᏂᎩᏍᏔᏁᏃ ᎤᏂᏙ ᎵᏇᎩ ᎠᎴ ᎤᏍᏛᏅᎯ ᎠᎴ ᎡᏆᎭᎻ ᎤᏅᏏᏓᏍᏗ ᎠᎴ ᎠᏂᏍᎦᏯ ᏓᏘᏁᎲᎢ.

source: and they bless Rebekah, and say to her, 'Thou [art] our sister; become thou thousands of myriads, and thy seed doth possess the gate of those hating it.'
chr: ᎣᏍᏛᏃ ᎤᏂᏁᏤᎴ ᎵᏇᎩ, ᎯᎠ ᏄᏂᏪᏎᎴᎢ; ᎣᎩᏙ ᏂᎯ, ᎠᏍᎪᎯ ᎢᏯᎦᏴᎵ ᎤᎦᏴᎳᏥᎶᏛ ᎿᎵᏍᏓᏅᎭ; ᎠᎴ ᏂᎯ ᏣᏁᏢᏔᏅᎯ ᏧᎾᏤᎵᎦ ᎨᏎᏍᏗ ᎬᏩᏂᏍᎦᎽ ᏚᏂᏍᏚᎲᎢ.

source: And Rebekah and her young women arise, and ride on the camels, and go after the man; and the servant taketh Rebekah and goeth.
chr: ᎵᏇᎩᏃ ᏚᎴᏁᎢ, ᎠᎴ ᎾᏍᎩ ᏧᏤᎵᎦ ᎠᎾᏛ, ᎠᎴ ᎨᎻᎵ ᏚᎾᎩᎸᏔᏁᎢ, ᎠᎴ ᎤᏂᏍᏓᏩᏛᏎ ᎾᏍᎩ ᎠᏍᎦᏯ. ᎠᎴ ᎾᏍᎩ ᎠᏥᏅᏏᏔᏍᏗ ᎤᏘᏅᏎ ᎵᏇᎩ ᎠᎴ ᎤᏂᎩᏎᎢ.

source: And Isaac hath come in from the entrance of the Well of the Living One, my Beholder; and he is dwelling in the land of the south,
chr: ᎡᏏᎩᏃ ᎳᎭᎢᎶᎢ ᎠᎹ ᎠᏢᏗᏱ ᎠᏔᎴᏒ ᎢᏗᏢ ᏧᎶᏎᎢ; ᏧᎦᎿᏮᏰᏃ ᎢᏗᏢ ᎡᎮᎢ.

source: and Isaac goeth out to meditate in the field, at the turning of the evening, and he lifteth up his eyes, and looketh, and lo, camels are coming.
chr: ᎡᏏᎩᏃ ᎤᏒᎯᏰᏱ ᎨᏒ ᏠᎨᏏ ᏭᎶᏎᎢ ᎤᏓᏅᏖᎵᏙᎸᏎᎢ; ᏗᎦᏙᎵᏃ ᏚᏌᎳᏓᏁᎢ, ᎠᎴ ᏫᏚᎧᎿᏁᎢ, ᎬᏂᏳᏉᏃ ᎨᎻᎵ ᏗᎾᎢᏎᎢ.

source: And Rebekah lifteth up her eyes, and seeth Isaac, and alighteth from off the camel;
chr: ᎵᏇᎩᏃ ᏚᏌᎳᏓᏁ ᏗᎦᏙᎵ, ᏒᏏᎩᏃ ᎤᎪᎲ, ᎤᏠᎠᏎ ᎨᎻᎵᎯ.

source: and she saith unto the servant, 'Who [is] this man who is walking in the field to meet us?' and the servant saith, 'It [is] my lord;' and she taketh the veil, and covereth herself.
chr: ᎯᎠᏰᏃ ᎢᏳᏪᏎᎸᎯ ᎨᏎ ᎠᏥᏅᏏᏓᏍᏗ; ᎦᎪ ᎢᏳᏍᏗ Ꮎ ᎠᏍᎦᏯ ᏠᎨᏏ ᏨᏓᏯᎢ ᏥᏙᏓᎦᏠᏏ? ᎠᏥᏅᏏᏓᏍᏗᏃ ᎯᎠ ᎢᏳᏪᏎᎸᎯ ᎨᏎᎢ, ᎠᎩᏅᏏᏙᎯ ᎾᏍᎩ. ᎾᏍᎩᏃ ᏗᎦᏚᏢᏙᏗ ᏚᎦᏚᏢᏔᏁᎢ.

source: And the servant recounteth to Isaac all the things that he hath done,
chr: ᎠᏥᏅᏏᏓᏍᏗᏃ ᎤᏃᏁᎴ ᎡᏏᎩ ᏂᎦᎥ ᏄᏛᏁᎵᏙᎸᎢ.

source: and Isaac bringeth her in unto the tent of Sarah his mother, and he taketh Rebekah, and she becometh his wife, and he loveth her, and Isaac is comforted after [the death of] his mother.
chr: ᎡᏏᎩᏃ ᎤᏘᏃᎴ ᎵᏇᎩ ᎤᏥ ᏎᎵ ᎤᎵᏦᏛᎢ, ᎠᎴ ᎤᏯᏅᎮ ᎵᏇᎩ, ᎤᏓᎵᎢᏃ ᏄᎵᏍᏔᏁᎢ, ᎠᎴ ᎤᎨᏳᎯᏳ ᎨᏎᎢ; ᎡᏏᎩᏃ ᎤᎦᎵᏍᏙᏎ ᎤᏥ ᎿᏉ ᎤᏲᎱᏒ.

source: Chapter 25
chr: ᎠᏯᏙᎸᎢ 25

source: And Abraham addeth and taketh a wife, and her name [is] Keturah;
chr: ᎡᏆᎭᎻᏃ ᏔᎵᏁ ᎤᏓᎵᎢ ᎤᏩᏛᎮᎢ, ᎠᎴ ᎩᏚᎳ ᏚᏙᎡᎢ.

source: and she beareth to him Zimran, and Jokshan, and Medan, and Midian, and Ishbak, and Shuah.
chr: ᎠᎴ ᎾᏍᎩ ᏚᎷᎸᏁᎴ ᏏᎻᎳᏂ, ᎠᎴ ᏲᎩᏌᏂ, ᎠᎴ ᎻᏓᏂ, ᎠᎴ ᎻᏗᏯᏂ, ᎠᎴ ᏱᏏᏆᎩ, ᎠᎴ ᏑᎠ.

source: And Jokshan hath begotten Sheba and Dedan; and the sons of Dedan were Asshurim, and Letushim, and Leummim;
chr: ᏲᎩᏌᏂᏃ ᏏᏱᏆ ᎠᎴ ᏗᏓᏂ ᎬᏩᏕᏁᎴᎢ. ᏗᏓᏂᏃ ᏧᏪᏥ ᎠᏁᎮᎢ, ᎠᏂᎠᏑᎵ, ᎠᏂᎵᏚᏏ, ᎠᎴ ᎠᏂᎵᎤᎻ.

source: and the sons of Midian [are] Ephah, and Epher, and Hanoch, and Abidah, and Eldaah: all these [are] sons of Keturah.
chr: ᎻᏗᏯᏂᏃ ᏧᏪᏥ, ᎢᏆ, ᎠᎴ ᎢᏆᎵ, ᎠᎴ ᎭᏃᎩ, ᎠᎴ ᎠᏡᏓ, ᎠᎴ ᎡˌᎵᏓᎠ. ᎯᎠ ᎾᏍᎩ ᏂᎦᏛ ᎩᏚᎳ ᏧᏪᏥ ᎨᏎᎢ.

source: And Abraham giveth all that he hath to Isaac;
chr: ᎡᏆᎭᎻᏃ ᏂᎦᏛ ᎤᎿᎥ ᎡᏏᎩ ᎤᏁᎴᎢ.

source: and to the sons of the concubines whom Abraham hath, Abraham hath given gifts, and sendeth them away from Isaac his son (in his being yet alive) eastward, unto the east country.
chr: ᏔᎵᏍᎩᏂ ᏂᏚᏮᏕ ᏥᏓᏓᏰᎮ ᎡᏆᎭᎻ ᎾᏍᎩ ᏧᏁᏥ ᎪᎱᏍᏗ ᏚᎵᏍᎪᎸᏓᏁᎴᎢ, ᎠᎴ ᏚᏪᎧᎲᏎ ᎤᏪᏥ ᎡᏏᎩ ᎡᎲᎢ, ᏗᎧᎸᎬ ᎢᏗᏢ ᏚᏅᏎ ᏗᎧᎸᎬ ᎢᏗᏢ ᎦᏓ ᏗᎲ ᏚᏅᏎᎢ, ᎠᏏᏉ ᎤᏩᏒ ᎡᎮᎢ.

source: And these [are] the days of the years of the life of Abraham, which he lived, a hundred and seventy and five years;
chr: ᎯᎠᏃ ᎾᏍᎩ ᏂᎦᎥ ᏚᎩᏨᏅᏒ ᎠᎴ ᏚᏕᏘᏱᎶᎥ ᎤᎴᏂᏙᎸ ᎡᏆᎭᎻ, ᎠᏍᎪᎯᏧᏈ ᎦᎵᏆᏍᎪᎯ ᎯᏍᎩᎦᎵ ᏧᏕᏘᏴᏛ.

source: and Abraham expireth, and dieth in a good old age, aged and satisfied, and is gathered unto his people.
chr: ᎡᏆᎭᎻᏃ ᎤᏲᎯᏍᏔᏁ ᎬᏬᎳᏕᏍᎬ, ᎠᎴ ᎣᏍᏛ ᎤᎦᏴᎳᏨᎯ ᎤᏲᎱᏎᎢ, ᎤᏛᏐᏅᎯ, ᎠᎴ ᏧᏕᏘᏱᎶᏛ ᎨᏎᎢ. ᎠᎴ ᏧᏤᎵ ᏴᏫ ᏄᎾᏛᏅ ᏭᏖᎳᏕᎢ.

source: And Isaac and Ishmael his sons bury him at the cave of Machpelah, at the field of Ephron, son of Zoar the Hittite, which [is] before Mamre --
chr: ᏧᏪᏥᏃ ᎡᏏᎩ ᎠᎴ ᎢᏏᎺᎵ ᎬᏩᏂᏌᏁ ᎤᏍᏓᎦᎸ ᎹᏡᎳ, ᎢᏆᎶᏂ ᎤᎶᎨᏒᎢ ᏐᎠ ᎠᎯᏗ ᎤᏪᏥ, ᎾᏍᎩ ᎹᎺᎵᏱ ᎢᎬᏱᏗᏢ ᏥᎩ;

source: the field which Abraham bought from the sons of Heth -- there hath Abraham been buried, and Sarah his wife.
chr: ᎾᏍᎩ ᏠᎨᏏ ᎡᏆᎭᎻ ᏥᏚᏩᏎᎴ ᎮᏗ ᏧᏪᏥ; ᎾᎿ ᎠᏥᏂᏌᏁ ᎡᏆᎭᎻ, ᎠᎴ ᏎᎵ ᎾᏍᎩ ᎤᏓᎵᎢ.

source: And it cometh to pass after the death of Abraham, that God blesseth Isaac his son; and Isaac dwelleth by the Well of the Living One, my Beholder.
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁ ᎡᏆᎭᎻ ᎿᏉ ᏄᏲᎱᏐᎢ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎣᏍᏛ ᏄᏛᏁᎴ ᎡᏏᎩ; ᎡᏏᎩᏃ ᎳᎭᎢᎶᎢ ᎠᎹ ᎠᏢᏗᏱ ᎠᏔᎴᏒ ᎦᏁᎴᎢ.

source: And these [are] births of Ishmael, Abraham's son, whom Hagar the Egyptian, Sarah's handmaid, hath borne to Abraham;
chr: ᎯᎠᏃ ᎾᏍᎩ ᏂᎤᏍᏗ ᎢᏏᎺᎵ ᎡᏆᎭᎻ ᎤᏪᏥ ᎤᏁᏢᏔᏅᏒᎢ, ᎾᏍᎩ ᎮᎦ ᎢᏥᏈᏱ ᎤᏕᏅᎯ, ᏎᎵ ᎤᏅᏏᏓᏍᏗ, ᎡᏆᎭᎻ ᏧᎾᏄᎪᏫᏎᎴᎢ;

source: and these [are] the names of the sons of Ishmael, by their names, according to their births: first-born of Ishmael, Nebajoth; and Kedar, and Adbeel, and Mibsam,
chr: ᎯᎠᏃ ᎾᏍᎩ ᏄᏍᏗ ᏚᎾᏙᎥ ᎢᏏᎺᎵ ᏧᏪᏥ, ᏚᎾᏙᎠᏗᏒ ᎾᏍᎩ ᏄᏍᏛ ᏚᎾᏁᏢᏔᏅᏒᎢ; ᎢᎬᏱ ᎡᎯ ᎢᏏᎺᎵ ᎤᏪᏥ, ᏂᏆᏲᏗ; ᎩᏓᏃ, ᎠᎴ ᎠᏗᏈᎵ, ᎠᎴ ᎻᏈᏌᎻ,

source: and Mishma, and Dumah, and Massa,
chr: ᎠᎴ ᎻᏏᎹ, ᎠᎴ ᏚᎹ, ᎠᎴ ᎹᏌ,

source: Hadar, and Tema, Jetur, Naphish, and Kedemah:
chr: ᎮᏓ, ᎠᎴ ᏗᎹ, ᎠᎴ ᏱᏓ, ᎠᎴ ᎾᏈᏏ, ᎠᎴ ᏱᏗᎹ;

source: these are sons of Ishmael, and these their names, by their villages, and by their towers; twelve princes according to their peoples.
chr: ᎯᎠ ᎾᏍᎩ ᎢᏏᎺᎵ ᏧᏪᏥ, ᎠᎴ ᎯᎠ ᎾᏍᎩ ᏄᏍᏗ ᏚᎾᏙᎥ ᏚᏂᏚᏩᏗᏒᎢ, ᎠᎴ ᏚᎾᏐᏯᏗᏒᎢ; ᏔᎳᏚ ᎤᏂᎬᏫᏳᎯ ᎾᏍᎩᏯ ᏂᎦᎥ ᎠᏰᎵ ᏚᏃᏢᏩᏗᏒᎢ.

source: And these [are] the years of the life of Ishmael, a hundred and thirty and seven years; and he expireth, and dieth, and is gathered unto his people;
chr: ᎯᎠᏃ ᎾᏍᎩ ᏄᏕᏘᏴᎮ ᎢᏏᎻᎵ ᎤᎴᏂᏙᎴᎢ, ᎠᏍᎪᎯᏧᏈ ᏦᎠᏍᎪᎯ ᎦᎵᏉᎩᎦᎵ ᎦᎵᏉᎩᎦᎵ ᏧᏕᏘᏴᏛ; ᎤᏲᎯᏍᏔᏁᏃ ᎬᏬᎳᏕᏍᎬ, ᎠᎴ ᎤᏲᎱᏎᎢ; ᎠᎴ ᏧᏤᎵᎦ ᏴᏫ ᏄᎾᏛᏅ ᏭᏖᎳᏗᎴᎢ.

source: and they tabernacle from Havilah unto Shur, which [is] before Egypt, in [thy] going towards Asshur; in the presence of all his brethren hath he fallen.
chr: ᎭᏈᎳᏃ ᎤᏓᎴᏅᏛ ᏒᎵ ᏫᎬᏍᏗ ᎠᏁᎮᎢ, ᎾᏍᎩ ᎢᏥᏈ ᎢᎬᏱᏗᏢ ᏥᎩ, ᎠᏏᎵᏯ ᏥᏮᎦᏙᎢ. ᎠᎴ ᏂᎦᏛ ᎠᎾᎵᏅᏟ ᎠᏂᎦᏔᎲ ᎤᏲᎱᏎᎢ.

source: And these [are] births of Isaac, Abraham's son: Abraham hath begotten Isaac;
chr: ᎯᎠᏃ ᎾᏍᎩ ᎡᏏᎩ ᎡᏆᎭᎻ ᎤᏪᏥ ᎤᏁᏢᏔᏅᏒᎢ; ᎡᏆᎭᎻ ᎡᏏᎩ ᎤᏕᏁᎴᎢ.

source: and Isaac is a son of forty years in his taking Rebekah, daughter of Bethuel the Aramaean, from Padan-Aram, sister of Laban the Aramaean, to him for a wife.
chr: ᎡᏏᎩᏃ ᏅᎦᏍᎪᎯ ᎢᏳᏕᏘᏴᏛ ᎨᏎ ᎵᏇᎩ ᎤᏓᏰᏅ, ᎾᏍᎩ ᏇᏚᎡᎵ ᏏᎵᏱ ᎡᎯ ᎤᏪᏥ, ᏇᏓᏁᎳᎻ ᏥᎦᏁᎴᎢ, ᎾᏍᎩ ᎤᏙ ᎴᏆᏂ ᏏᎵᏱ ᎡᎯ.

source: And Isaac maketh entreaty to Jehovah before his wife, for she [is] barren: and Jehovah is entreated of him, and Rebekah his wife conceiveth,
chr: ᎡᏏᎩᏃ ᏱᎰᏩ ᎤᏓᏙᎵᏍᏓᏁᎴ ᎤᏓᎵᎢ ᎤᎬᏩᎵ, ᏂᏓᎷᎸᎥᏍᎬᎾᏰᏃ ᎨᏎᎢ; ᏱᎰᏩᏃ ᎤᏛᏓᏍᏓᏁᎴᎢ, ᎤᏓᎵᎢᏃ ᎵᏇᎩ ᎤᏁᎵᏤᎢ.

source: and the children struggle together within her, and she saith, 'If [it is] right -- why [am] I thus?' and she goeth to seek Jehovah.
chr: ᏗᏂᏲᎵᏃ ᏓᎾᏟᏱᏍᎨ ᎬᏩᏯᎥᎢ; ᎯᎠᏃ ᏄᏪᏎᎢ, ᎢᏳᏃ ᎾᏍᎩ ᏱᏄᏍᏗ, ᎦᏙᏃ ᎾᏍᎩ ᎯᎠ ᏥᎾᏆᏍᏗ? ᎤᏪᏅᏎᏃ ᏱᎰᏩ ᎤᏛᏛᏅᏎᎢ.

source: And Jehovah saith to her, 'Two nations [are] in thy womb, and two peoples from thy bowels are parted; and the [one] people than the [other] people is stronger; and the elder doth serve the younger.'
chr: ᏱᎰᏩᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᏔᎵ ᎢᏯᏂᎵᏍᏓᎳ ᏴᏫ ᏕᎯᏁᎵ, ᎠᎴ ᏔᎵ ᎢᏳᎾᏓᎴᎩ ᏴᏫ ᏙᏘᎾᏄᎪᏫᏏ; ᏑᎾᏓᎴᎩᏃ ᎾᏍᎩ ᏴᏫ ᎤᏟ ᏄᎾᎵᏂᎬᎨᏍᏗ ᎡᏍᎦᏉ ᎠᏂᏐᎢ ᏴᏫ; ᎤᏓᏂᎵᎨᏃ ᏕᎤᏁᎶᏕᏍᏗ ᎣᏂ ᎡᎯ.

source: And her days to bear are fulfilled, and lo, twins [are] in her womb;
chr: ᏧᎾᏄᎪᏫᏍᏗᏱᏃ ᎤᏍᏆᎸᎲ, ᎬᏂᏳᏉ ᏗᏂᎳᏫ ᏕᎦᏁᎵᏎᎢ.

source: and the first cometh out all red as a hairy robe, and they call his name Esau;
chr: ᎢᎬᏱᏃ ᎠᏬᏗᎨ ᏧᎾᏄᎪᏤᎢ, ᏂᎬ ᎠᏄᏬ ᎤᏂᏆᏟ ᎾᏍᎩᏯ ᎨᏎᎢ; ᎾᏍᎩᏃ ᎢᏐ ᏚᏃᎡᎢ.

source: and afterwards hath his brother come out, and his hand is taking hold on Esau's heel, and one calleth his name Jacob; and Isaac [is] a son of sixty years in her bearing them.
chr: ᎣᏂᏃ ᎤᏅᏟ ᎤᎾᏄᎪᏤᎢ, ᎾᏍᎩᏃ ᎤᏬᏰᏂ ᎢᏐ ᎦᏗᎨᏂ ᎤᏂᏴᎮᎢ; ᏤᎦᏈᏃ ᏚᏃᎡᎢ; ᎡᏏᎩᏃ ᏑᏓᎳᏍᎪᎯ ᎢᏳᏕᏗᏴᏛ ᎨᏎ ᎵᏇᎩ ᏚᎷᎸᏅ.

source: And the youths grew, and Esau is a man acquainted [with] hunting, a man of the field; and Jacob [is] a plain man, inhabiting tents;
chr: ᎠᏂᏧᏣᏃ ᏚᎾᏛᏎᎢ; ᎢᏐᏃ ᎠᏏᎾᏌᏂ ᎦᏃᎯᎵᏙᎯ ᎨᏎᎢ, ᎢᎾᎨ ᎡᏙᎯ ᎨᏎᎢ; ᏤᎦᏈᏃ ᎤᏓᏅᏘ ᎠᏍᎦᏯ ᎨᏎᎢ, ᏕᎦᎵᏦᏛᏉ ᎡᎯ ᎨᏎᎢ.

source: and Isaac loveth Esau, for [his] hunting [is] in his mouth; and Rebekah is loving Jacob.
chr: ᎡᏏᎩᏃ ᎢᏐ ᎤᎨᏳᎯᏳ ᎨᏎᎢ, ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᎠᏫ ᎤᏫᏯ ᎠᎩᏍᎬᎢ; ᎵᏇᎩᏍᎩᏂ ᏤᎦᏈ ᎤᎨᏳᎯᏳ ᎨᏎᎢ.

source: And Jacob boileth pottage, and Esau cometh in from the field, and he [is] weary;
chr: ᏤᎦᏈᏃ ᏚᏯ ᎢᏳᎾᏍᏗ ᏕᎫᎲᏍᎨᎢ, ᎢᏐᏃ ᎢᎾᎨ ᏧᎶᏎᎢ, ᎠᎴ ᎠᎪᏄ ᎤᎸᏕᏍᏗᏍᎨᎢ.

source: and Esau saith unto Jacob, 'Let me eat, I pray thee, some of this red red thing, for I [am] weary;' therefore hath [one] called his name Edom [Red];
chr: ᎢᏐᏃ ᎯᎠ ᏄᏪᏎᎴ ᏤᎦᏈ, ᏍᏇᎳᏍᏓ ᎩᎦᎨ, Ꮎ ᎩᎦᎨ ᏥᏧᎭ, ᎠᎪᏄᏰᏃ ᎠᏆᎸᏕᏍᏗᎭ; ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏓᎻ ᏓᎪᎡᎢ.

source: and Jacob saith, 'Sell to-day thy birthright to me.'
chr: ᏤᎦᏈᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎪᎯ ᎢᎦ ᏥᎩ ᎢᎬᏱ ᎮᎯ ᎨᏒ ᏍᎩᏃᏓᏏ.

source: And Esau saith, 'Lo, I am going to die, and what is this to me -- birthright?'
chr: ᎢᏐᏃ ᎯᎠ ᏄᏪᏎᎢ, ᎬᏂᏳᏉ ᎠᎩᏲᎱᏏᏗ ᎠᏴ; ᎦᏙᏃ ᏯᎩᏁᏉᏥ ᎯᎠ ᎾᏍᎩ ᎢᎬᏱ ᎨᎢ ᎨᏒᎢ?

source: and Jacob saith, 'Swear to me to-day:' and he sweareth to him, and selleth his birthright to Jacob;
chr: ᏤᎦᏈᏃ ᎯᎠ ᏄᏪᏎᎢ, ᎪᎯ ᎢᎦ ᏥᎩ ᏍᏆᏎᎵᏓᏏ; ᎤᏎᎵᏓᏁᎴᏃ; ᎠᎴ ᎢᎬᏱ ᎡᎯ ᎨᏒ ᏤᎦᏈ ᎤᏃᏓᏁᎴᎢ.

source: and Jacob hath given to Esau bread and pottage of lentiles, and he eateth, and drinketh, and riseth, and goeth; and Esau despiseth the birthright.
chr: ᏤᎦᏈᏃ ᎦᏚ ᎠᎴ ᏚᏯ ᎢᏳᎾᏍᏗ ᏗᎫᏅᎯ ᏚᏁᎴ ᎢᏐ, ᎤᎵᏍᏓᏴᏁᏃ, ᎠᎴ ᎤᏗᏔᎮᎢ, ᎠᎴ ᏚᎴᏁᎢ, ᎠᎴ ᎤᏓᏅᏎᎢ; ᎾᏍᎩᏃ ᎢᏐ ᏄᎸᏉᏔᏅᎾᏉ ᎨᏎ ᎢᎬᏱ ᎡᎯ ᎨᏒᎢ.

source: Chapter 26
chr: ᎠᏯᏙᎸᎢ 26

source: And there is a famine in the land, besides the first famine which was in the days of Abraham, and Isaac goeth unto Abimelech king of the Philistines, to Gerar.
chr: ᏔᎵᏁᏃ ᎤᎪᏄᎶᏎ ᎾᎿ ᎤᏁᎳᎩ ᎢᎬᏱᏱ ᏧᎪᏄᎶᏎᎢ ᎾᎯᏳ ᎡᏆᎭᎻ ᏤᎮᎢ. ᎡᏏᎩᏃ ᎠᏈᎻᎴᎩᏱ ᏭᎶᏎ ᎤᎬᏫᏳᎯ ᎠᏂᏈᎵᏍᏗ ᎤᎾᏤᎵᎦ, ‾ᎩᎳ ᏗᎦᏚᎲᎢ.

source: And Jehovah appeareth unto him, and saith, 'Go not down towards Egypt, tabernacle in the land concerning which I speak unto thee,
chr: ᏱᎰᏩᏃ ᎬᏂᎨᏒ ᏄᏛᏁᎴᎢ, ᎯᎠᏃ ᏄᏪᏎᎢ, ᏞᏍᏗ ᎢᏥᏈᏱ ᏫᏣᎶᏒᎩ; ᎾᎿᏉᏍᎩᏂ ᎦᏙᎯ ᏨᏓᎬᏯᏎᎮᎵ ᎮᎮᏍᏗ;

source: sojourn in this land, and I am with thee, and bless thee, for to thee and to thy seed I give all these lands, and I have established the oath which I have sworn to Abraham thy father;
chr: ᎠᏂ ᎯᎠ ᎦᏓ ᎠᎲ ᎮᎮᏍᏗ, ᎠᏴᏃ ᏕᎬᎦᎿᏩᏗᏙᎮᏍᏗ, ᎠᎴ ᎣᏍᏛ ᏂᎬᏯᏛᏁᎮᏍᏗ; ᏂᎯᏰᏃ, ᎠᎴ ᏂᎯ ᏣᏁᏢᏔᏅᎯ ᏓᏨᏁᎵ ᏂᎦᏛ ᎠᏂ ᏂᎬᎾᏛᎢ; ᎠᎴ ᏅᏓᎦᏛᏁᎵ ᏄᏍᏛ ᏥᏯᏎᎵᏓᏁᎸ ᎡᏆᎭᎻ ᏣᏙᏓ;

source: and I have multiplied thy seed as stars of the heavens, and I have given to thy seed all these lands; and blessed themselves in thy seed have all nations of the earth;
chr: ᎠᎴ ᎤᏂᏁᏉᎢᏍᏗᏱ ᏅᏓᎦᏥᏴᏁᎵ ᏂᎯ ᏣᏁᏢᏔᏅᎯ ᎨᏒ ᎾᏍᎩᏯ ᏃᏈᏏ ᎦᎸᎶ ᏣᏂᎧᎳ, ᎠᎴ ᏂᎯ ᏣᏁᏢᏔᏅᎯ ᏓᎦᏥᏁᎵ ᏂᎦᏛ ᎠᏂ ᏂᎬᎾᏛᎢ; ᏂᎯᏃ ᏣᏁᏢᏔᏅᎯ ᎨᏒ ᏅᏓᎦᎵᏍᏙᏔᏂ ᏄᎾᏓᎴᏒ ᏴᏫ ᎡᎶᎯ ᎤᎾᏕᏗ ᏥᏅᏓᎦᎵᏍᏔᏂ ᎣᏍᏛ ᎢᏳᎾᎵᏍᏓᏁᏗ ᎨᏎᏍᏗ;

source: because that Abraham hath hearkened to My voice, and keepeth My charge, My commands, My statutes, and My laws.'
chr: ᏂᎦᎵᏍᏙᏗᎭ ᎡᏆᎭᎻ ᎤᏬᎯᏳᏅ ᏥᏁᎬᎢ, ᎠᎴ ᎤᏍᏆᏂᎪᏔᏅ ᎠᏆᏤᎵ ᎠᏍᏆᏂᎪᏙᏗ, ᎠᎴ ᎠᎩᏁᏨᎢ, ᎠᎴ ᏗᏆᏤᎵ ᏚᏚᎪᏔᏅᎢ, ᎠᎴ ᏗᏆᏤᎵ ᏗᎦᎿᏩᏛᏍᏗ.

source: And Isaac dwelleth in Gerar;
chr: ᎡᏏᎩᏃ ‾ᎩᎳ ᎡᎮᎢ.

source: and men of the place ask him of his wife, and he saith, 'She [is] my sister:' for he hath been afraid to say, 'My wife -- lest the men of the place kill me for Rebekah, for she [is] of good appearance.'
chr: ᎾᎿᏃ ᎠᏁᎯ ᎠᏂᏍᎦᏯ ᎬᏩᏛᏛᏁ ᎤᏓᎵᎢ ᎤᏂᏁᎢᏍᏔᏁᎢ; ᎯᎠᏃ ᏄᏪᏎᎢ, ᎥᎩᏙᏉ; ᎠᏍᎦᎢᎮᏰᏃ ᎠᏆᏓᎵᎢ ᎤᏛᏗᏱ; ᎠᏂᏍᎦᏯᏰᏃ ᎠᏂ ᎠᏁᎯ ᏱᎬᎩᎷᎦ ᎵᏇᎩ ᏯᎩᏍᏛᏓ [ᎡᎵᏍᎨᎢ,] ᎤᏬᏚᎯᏳᏰᏃ ᎨᏎ ᏗᎧᏃᏗᏱ.

source: And it cometh to pass, when the days have been prolonged to him there, that Abimelech king of the Philistines looketh through the window, and seeth, and lo, Isaac is playing with Rebekah his wife.
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁ ᎿᏉ ᎪᎯᏗᏳ ᎾᎿ ᏫᎬᏩᎷᏨᎯ ᎨᏎᎢ, ᎠᏈᎻᎴᎩ ᎤᎬᏫᏳᎯ ᎠᏂᏈᎵᏍᏗ ᎤᎾᏤᎵᎦ, ᎾᏍᎩ ᎠᏦᎳᏅ ᏭᎦᏔᏁᎢ, ᎠᎴ ᎤᎪᎮᎢ, ᎠᎴ ᎬᏂᏳᏉ ᎡᏏᎩ ᏓᎾᏓᏰᏣᏍᏗᏍᎨ ᎵᏇᎩ ᎤᏓᎵᎢ.

source: And Abimelech calleth for Isaac, and saith, 'Lo, she [is] surely thy wife; and how hast thou said, She [is] my sister?' and Isaac saith unto him, 'Because I said, Lest I die for her.'
chr: ᎠᏈᎻᎴᎩᏃ ᏭᏯᏅᎮ ᎡᏏᎩ, ᎠᎴ ᎯᎠ ᏄᏪᏎᎢ, ᎬᏂᏳᏉ, ᎤᏙᎯᏳᏒ ᏣᏓᎵᎢ ᎾᏍᎩ; ᎦᏙᏃ ᎥᎩᏙᏉ ᏥᏣᏛᏁᎢ? ᎡᏏᎩᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᏅᏓᎦᎵᏍᏙᏗᏍᎬᎩ ᏱᏥᏲᎤᎯ ᎾᏍᎩ ᏯᎩᏍᏛᏓ, ᎠᏇᎵᏒᎢ.

source: And Abimelech saith, 'What [is] this thou hast done to us? as a little thing one of the people had lain with thy wife, and thou hadst brought upon us guilt;'
chr: ᎠᏈᎻᎴᎩᏃ ᎯᎠ ᏄᏪᏎᎢ, ᎦᏙᏃ ᎾᏍᎩ ᎯᎠ ᏥᏂᏍᎩᏴᎦ; ᎩᎶᏰᏃ ᎯᎠ ᏴᏫ ᎠᎴᏉ ᏄᏓᏰᎾ ᏣᏓᎵᎢ, ᎠᎴ ᎣᎩᏍᎦᏅᏨᎯ ᏂᏍᎩᏴᎦ.

source: and Abimelech commandeth all the people, saying, 'He who cometh against this man or against his wife, dying doth die.'
chr: ᎠᏈᎻᎴᎩᏃ ᏚᏁᏤᎴ ᏂᎦᏛ ᏴᏫ, ᎯᎠ ᏄᏪᏎᎢ, ᎢᏳᏃ ᎩᎶ ᎪᎱᏍᏗ ᎢᎬᏁᎸᎭ ᎯᎠ ᎠᏍᎦᏯ, ᎠᎴ ᎤᏓᎵᎢ, ᎤᏙᎯᏳᎯᏯ ᎠᏥᎢᏍᏗ ᎨᏎᏍᏗ.

source: And Isaac soweth in that land, and findeth in that year a hundredfold, and Jehovah blesseth him;
chr: ᎡᏏᎩᏃ ᎾᎿ ᎦᏙᎯ ᎤᏫᏒᏁᎢ, ᎾᎯᏳᏉᏃ ᎤᏕᏘᏴᏌᏗᏒ ᎠᏍᎪᎯᏧᏈ ᎢᏳᏩᎫᏗ ᎤᏁᏉᏨᎯ ᎤᏩᏛᎮᎢ, ᎠᎴ ᏱᎰᏩ ᎣᏍᏛ ᏄᏛᏁᎴᎢ.

source: and the man is great, and goeth on, going on and becoming great, till that he hath been very great,
chr: ᎯᎠᏃ ᎾᏍᎩ ᎠᏍᎦᏯ ᎠᏥᎸᏉᏗᏳ ᏄᎵᏍᏔᏁᎢ, ᎠᎴ ᏩᎦᏖᏉ ᎤᏛᏏᏗᏒᎢ, ᎬᏂ ᎤᏣᏘ ᎠᏥᎸᏉᏗᏳ ᏄᎵᏍᏔᏅ.

source: and he hath possession of a flock, and possession of a herd, and an abundant service; and the Philistines envy him,
chr: ᎠᏫᏃ ᏚᎾᏝᎡᎢ, ᎠᎴ ᏩᎦ ᏚᎾᏝᎡᎢ, ᎠᎴ ᎤᏂᏣᏘ ᏚᏪᎧᎮ ᏧᏅᏏᏓᏍᏗ; ᎠᏂᏈᎵᏍᏗᏃ ᎬᏩᏳᏤᎮᎢ.

source: and all the wells which his father's servants digged in the days of Abraham his father, the Philistines have stopped them, and fill them with dust.
chr: ᏂᎦᏛᏃ ᎠᎹ ᎠᏢᏗᏱ ᏓᏍᎪᏒ ᎾᏍᎩ ᎤᏙᏓ ᏧᏅᏏᏓᏍᏗ ᏚᎾᏍᎪᏒᎢ ᎾᎯᏳ ᎤᏙᏓ ᎡᏆᎭᎻ ᏤᎮᎢ, ᎠᏂᏈᎵᏍᏗ ᏚᏂᏍᏚᏁᎢ, ᎠᎴ ᎦᏓ ᏚᏂᎧᎵᏍᏔᏁᎢ.

source: And Abimelech saith unto Isaac, 'Go from us; for thou hast become much mightier than we;'
chr: ᎠᏈᎻᎴᎩᏃ ᎯᎠ ᏄᏪᏎᎴ ᎡᏏᎩ, ᏍᎩᏯᏓᏅᏏ; ᎤᏟᎯᏳᏰᏃ ᏂᏣᎵᏂᎬᎦ ᎡᏍᎦᏉ ᎠᏴ.

source: and Isaac goeth from thence, and encampeth in the valley of Gerar, and dwelleth there;
chr: ᎡᏏᎩᏃ ᎾᎿ ᎤᏓᏅᏎᎢ, ‾ᎩᎳ ᎤᎨᏓᎵᏴ ᎤᎵᏦᏔᏁᎢ, ᎠᎴ ᎾᎿ ᎡᎮᎢ.

source: and Isaac turneth back, and diggeth the wells of water which they digged in the days of Abraham his father, which the Philistines do stop after the death of Abraham, and he calleth to them names according to the names which his father called them.
chr: ᎡᏏᎩᏃ ᏔᎵᏁ ᏚᏍᎪᏎ ᎠᎹ ᏗᏢᏗᏱ ᎾᏍᎩ ᏥᏚᎾᏍᎪᏎ ᎾᎯᏳ ᎤᏙᏓ ᎡᏆᎭᎻ ᏤᎮᎢ; ᎠᏂᏈᎵᏍᏗ ᏥᏚᏂᏍᏚᏁ ᎡᏆᎭᎻ ᎤᏲᎱᏒ; ᎠᎴ ᎤᏙᏓ ᏄᏍᏛ ᏚᏬᎥ ᎾᏍᎩᏯᏉ ᎠᏏ ᏚᏬᎡᎢ.

source: And Isaac's servants dig in the valley, and find there a well of living water,
chr: ᎡᏏᎪᏃ ᏧᏅᏏᏓᏍᏗ ᎤᎾᏍᎪᏎ ᎤᎨᏓᎵᏴᎢ, ᎠᎴ ᎾᎿ ᎤᏂᏩᏛᎮ ᎠᎹ ᎦᏄᎪᎬᎢ.

source: and shepherds of Gerar strive with shepherds of Isaac, saying, 'The water [is] ours;' and he calleth the name of the well 'Strife,' because they have striven habitually with him;
chr: ‾ᎩᎳᏃ ᎠᏁᎯ ᎦᎾᏝᎢ ᏗᏂᎦᏘᏯ ᎬᏩᎾᏟᏒᏎᎮ ᎡᏏᎩ ᏧᏤᎵ ᎦᎾᏝᎢ ᏗᏂᎦᏘᏯ, ᎯᎠ ᎾᏂᏪᏍᎨᎢ, ᎠᎹ ᎠᏴ ᎣᎦᏤᎵᎦ; ᎾᏍᎩᏃ ᎠᎹ ᎠᏢᏗᏱ ᎠᏍᎪᏒ ᎢᏎᎩ ᏚᏬᎡᎢ; ᏂᎦᎵᏍᏙᏗᏍᎨ ᎬᏩᏗᏒᏎᎸᎢ.

source: and they dig another well, and they strive also for it, and he calleth its name 'Hatred.'
chr: ᎠᎴ ᏅᏩᏓᎴ ᎤᎾᏍᎪᏎ ᎠᎹ ᎠᏢᏗᏱ, ᎾᏍᏉᏃ ᎾᏍᎩ ᎤᎾᏘᏒᎴᎢ; ᎾᏍᎩᏃ ᏏᏘᎾ ᏚᏬᎡᎢ.

source: And he removeth from thence, and diggeth another well, and they have not striven for it, and he calleth its name Enlargements, and saith, 'For -- now hath Jehovah given enlargement to us, and we have been fruitful in the land.'
chr: ᎾᎿᏃ ᎤᏓᏅᏎᎢ, ᎠᎴ ᏄᏓᎴ ᎤᏍᎪᏎ ᎠᎹ ᎠᏢᏗᏱ; ᎾᏍᎩᏃ ᎥᏝ ᏳᎾᏘᏒᎴᎢ; ᎾᏍᎩᏃ ᎵᎰᏉ ᏚᏬᎡᎢ; ᎯᎠᏃ ᏄᏪᏎᎢ, ᏱᎰᏩᏰᏃ ᎿᏉ ᎢᎩᎳᏅᏓᏗᏏ, ᎠᎴ ᎠᏂ ᎦᏙᎯ ᏓᏗᏁᏉᏥ.

source: And he goeth up from thence [to] Beer-Sheba,
chr: ᎾᎿᏃ ᎤᏓᏅᏒ ᏈᏯᏏᏱᏆ ᏭᎶᏎᎢ.

source: and Jehovah appeareth unto him during that night, and saith, 'I [am] the God of Abraham thy father, fear not, for I [am] with thee, and have blessed thee, and have multiplied thy seed, because of Abraham My servant;'
chr: ᎾᎯᏳᏉᏃ ᏒᏃᏱ ᏱᎰᏩ ᎬᏂᎨᏒ ᏄᏛᏁᎴᎢ, ᎯᎠᏃ ᏄᏪᏎᎢ, ᎠᏴ ᎠᏆᏁᎳᏅᎯ ᎡᏆᎭᎻ ᏣᏙᏓ ᎤᏤᎵᎦ; ᏞᏍᏗ ᏱᎾᏰᏍᎨᏍᏗ, ᎠᏴᏰᏃ ᏕᎬᎦᎿᏩᏗᏙᎭ, ᎠᎴ ᎣᏍᏛ ᏅᏓᎬᏯᏛᏁᎵ, ᎠᎴ ᏂᎯ ᏣᏁᏢᏔᏅᎯ ᏓᎦᏥᏁᏉᎢ ᎡᏆᎭᎻ ᏥᏅᏏᏓᏍᏗ ᏅᏗᎦᎵᏍᏙᏗᏍᎨᏍᏗ.

source: and he buildeth there an altar, and preacheth in the name of Jehovah, and stretcheth out there his tent, and there Isaac's servants dig a well.
chr: ᎾᎿᏃ ᎠᏥᎸ ᎨᎳᏍᏗᏱ ᎤᏬᏢᏁᎢ, ᎠᎴ ᏱᎰᏩ ᎤᏓᏙᎵᏍᏓᏁᎴᎢ, ᎠᎴ ᎾᎿ ᎤᎵᏦᏔᏁᎢ; ᎠᎴ ᎾᎿ ᎡᏏᎩ ᏧᏅᏏᏓᏍᏗ ᎠᎹ ᎠᏢᏗᏱ ᎤᎾᏍᎪᏎᎢ.

source: And Abimelech hath gone unto him from Gerar, and Ahuzzath his friend, and Phichol head of his host;
chr: ᎿᏉᏃ ᎠᏈᎻᎴᎩ ᎩᎳ ᎤᏂᎩᏎᎢ [ᎡᏏᎩᏃ] ᏭᎷᏤᎴᎢ, ᎠᎴ ᎠᎭᏌ [ᎠᏈᎻᎴᎩ] ᎤᎾᎵᎢ, ᎠᎴ ᏈᎪᎵ ᏧᏤᎵ ᎠᏂᏯᏫᏍᎩ ᏄᎬᏫᏳᏒ ᏗᏘᏂᏙᎯ.

source: and Isaac saith unto them, 'Wherefore have ye come unto me, and ye have hated me, and ye send me away from you?'
chr: ᎡᏏᎩᏃ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎦᏙᏃ ᎥᏍᎩᎷᏥᏏ, ᏍᎩᏂᏆᏘᎯᏃ ᏥᎩ, ᎠᎴ ᎢᏤᎲ ᏍᎩᎨᎯᏙᎸᎯ ᏥᎩ?

source: And they say, 'We have certainly seen that Jehovah hath been with thee, and we say, 'Let there be, we pray thee, an oath between us, between us and thee, and let us make a covenant with thee;
chr: ᎯᎠᏃ ᏄᏂᏪᏎᎢ, ᎤᏙᎯᏳᏒᏍᎩᏂ ᎣᎩᎪᎲᎩ ᏱᎰᏩ ᏕᏣᎧᎿᏩᏗᏙᎲᎢ; ᎯᎠᏃ ᏃᎩᏪᏒᎩ, ᏗᎦᏓᏎᎵᏓᏁᎸᎯ ᎨᏎᏍᏗ, ᎠᏴ ᏂᎯᏃ, ᎠᎴ ᎧᏃᎮᏛ ᏗᏓᏠᎯᏍᏓ;

source: do not evil with us, as we have not touched thee, and as we have only done good with thee, and send thee away in peace; thou [art] now blessed of Jehovah.'
chr: ᎾᏍᎩ ᎪᎱᏍᏗ ᎤᏲ ᏍᎩᏴᏁᏗᏱ ᏂᎨᏒᎾ, ᎾᏍᎩᏯ ᎪᎱᏍᏗ ᎢᏨᏴᏁᎸᎯ ᏂᎨᏒᎾ ᏥᎩ, ᎠᎴ ᎣᏍᏛᏉ ᎢᏨᏯᏛᏁᎸᎯ ᏥᎩ, ᎠᎴ ᏅᏩᏙᎯᏯᏛ ᎢᏨᏯᏂᎩᏍᏔᏅᎯ ᏥᎩ; ᏂᎯ ᎿᏉ ᏱᎰᏩ ᎣᏍᏛ ᎢᏣᏛᏁᎸᎯ ᎢᎩ.

source: And he maketh for them a banquet, and they eat and drink,
chr: ᏚᏛᏅᎢᏍᏓᏁᎴᏃ ᎠᎵᏍᏓᏴᏗ, ᎤᎾᎵᏍᏓᏴᏁᏃ, ᎠᎴ ᏚᎾᏘᏔᎮᎢ.

source: and rise early in the morning, and swear one to another, and Isaac sendeth them away, and they go from him in peace.
chr: ᏑᎾᎴᏉᏃ ᏚᎾᏗᏛᎮᎢ, ᎠᎴ ᏚᎾᏓᏎᎵᏓᏁᎴᎢ; ᎡᏏᎩᏃ ᏚᏂᎩᏍᏔᏁᎢ, ᎠᎴ ᏅᏩᏙᎯᏯᏛ ᎢᎬᏩᏂᎩᎡᎴᎢ.

source: And it cometh to pass during that day that Isaac's servants come and declare to him concerning the circumstances of the well which they have digged, and say to him, 'We have found water;'
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁ ᎾᎯᏳᏉ ᎢᎦ, ᎾᏍᎩ ᎡᏏᎩ ᏧᏅᏏᏓᏍᏗ ᎬᏩᎷᏤᎴᎢ, ᎠᎴ ᎬᏩᏃᏁᎴ ᎠᎹ ᎠᏢᏗᏱ ᎤᎾᏍᎪᏒ ᎤᎬᏩᎵ, ᎠᎴ ᎯᎠ ᏂᎬᏩᏪᏎᎴᎢ, ᎠᎹ ᎣᏥᏁᏩᏛ.

source: and he calleth it Shebah, [oath,] therefore the name of the city [is] Beer-Sheba, [well of the oath,] unto this day.
chr: ᏏᏱᏆᏃ ᏚᏬᎡᎢ; ᎾᏍᎩ ᎢᏳᏍᏗ ᎾᎿ ᎦᏚᎲ ᎩᎳᎯᏳ ᏈᏯᏏᏱᏆ ᏚᏙᎥ.

source: And Esau is a son of forty years, and he taketh a wife, Judith, daughter of Beeri the Hittite, and Bashemath, daughter of Elon the Hittite,
chr: ᎢᏐᏃ ᏅᎦᏍᎪᎯ ᎢᏳᏕᏘᏴᏛ ᎨᏎ ᎾᎯᏳ ᏥᏚᏓᏴᏎ ᏧᏗ ᏈᎢᎳ ᎤᏪᏥ ᎾᏍᎩ ᎠᎯᏗ, ᎠᎴ ᏆᏏᎹ ᎢᎶᏂ ᎤᏪᏥ ᎾᏍᎩ ᎠᎯᏗ.

source: and they are a bitterness of spirit to Isaac and to Rebekah.
chr: ᎾᏍᎩᏃ ᎯᎠ ᎡᎯᏍᏗ ᎤᎾᏓᏅᏓᏗᏍᏗᏍᎩ ᎨᏎ ᎡᏏᎩ ᎠᎴ ᎵᏇᎩ.

source: Chapter 27
chr: ᎠᏯᏙᎸᎢ 27

source: And it cometh to pass that Isaac [is] aged, and his eyes are too dim for seeing, and he calleth Esau his elder son, and saith unto him, 'My son;' and he saith unto him, 'Here [am] I.'
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁᎢ, ᎾᏍᎩ ᎿᏉ ᎡᏏᎩ ᎤᏛᏐᏅᎯ ᎨᏎᎢ, ᎠᎴ ᏧᏍᎪᎸᎢ ᎨᏎ ᏗᎦᏙᎵ, ᎾᏍᎩ ᎬᏩᎪᏩᏛᏗ ᏂᎨᏒᎾ ᎨᏒᎢ, ᎾᏍᎩ ᏭᏯᏅᎮ ᎢᏐ ᎤᏓᏂᎵᎨ ᎤᏪᏥ, ᎠᎴ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎠᏇᏥ; ᎯᎠᏃ ᏄᏪᏎᎴᎢ, ᎠᏂᏲ.

source: And he saith, 'Lo, I pray thee, I have become aged, I have not known the day of my death;
chr: ᎯᎠᏃ ᏄᏪᏎᎢ, ᎬᏂᏳᏉ ᎿᏉ ᎠᏆᏛᏐᏅᎯ, ᎥᏝ ᏱᏥᎦᏔᎭ ᎢᏳᏉ ᎠᎩᏲᎱᎯᏍᏗᏱ;

source: and now, take up, I pray thee, thy instruments, thy quiver, and thy bow, and go out to the field, and hunt for me provision,
chr: Ꭷ, ᏘᏄᎦ ᏗᏣᎵᏍᎦᏍᏙᏗ, ᎦᏃᏟ ᎠᎴ ᎦᎶᏣᏗ, ᎠᎴ ᎢᎾᎨ ᏫᎶᎯ, ᎠᏫᏃ ᎤᏫᏯ ᏍᎩᏲᏎᎷᎦ;

source: and make for me tasteful things, [such] as I have loved, and bring in to me, and I do eat, so that my soul doth bless thee before I die.'
chr: ᎠᎴ ᎤᎦᎾᏍᏛ ᎠᎵᏍᏓᏴᏗ ᏍᏆᏛᏅᎢᏍᏓᏁᎸᎭ, ᎾᏍᎩ ᎣᏏ ᏣᎩᏰᎸᎭ, ᎠᎴ ᏍᎩᏲᎮᎸᎭ, ᎠᎴ ᏥᎬᎭ; ᎾᏍᎩ ᎠᏆᏓᏅᏙ ᎣᏍᏛ ᏣᏁᏤᏗᏱ ᎠᏏᏉ ᎾᎩᏲᎱᏒᎾ.

source: And Rebekah is hearkening while Isaac is speaking unto Esau his son; and Esau goeth to the field to hunt provision -- to bring in;
chr: ᎵᏇᎩᏃ ᎤᏛᎦᏁ ᎡᏏᎩ ᎤᏁᏤᎸ ᎤᏪᏥ ᎢᏐ. ᎢᏐᏃ ᎢᎾᎨ ᏭᎶᏎ ᎠᏫ ᎤᏫᏯ ᎤᏲᎸᏎ ᎤᏲᎯᏍᏗ.

source: and Rebekah hath spoken unto Jacob her son, saying, 'Lo, I have heard thy father speaking unto Esau thy brother, saying,
chr: ᎵᏇᎩᏃ ᎤᏁᏤᎴ ᎤᏪᏥ ᏤᎦᏈ, ᎯᎠ ᏄᏪᏎᎢ, ᎬᏂᏳᏉ ᎦᏛᎬᎦ ᏣᏙᏓ ᎧᏁᏤᎲ ᏗᏍᏓᏓᏅᏟ ᎢᏐ, ᎯᎠ ᏂᎦᏪᏍᎬᎢ,

source: Bring for me provision, and make for me tasteful things, and I do eat, and bless thee before Jehovah before my death.
chr: ᎠᏫ ᎤᏫᏯ ᏍᎩᏲᎯᏏ ᎠᎴ ᎤᎦᎾᏍᏛ ᎠᎵᏍᏓᏴᏗ ᏍᏆᏛᏅᎢᏍᏓᏏ, ᎠᎴ ᏥᎬᎭ, ᎠᎴ ᎣᏍᏛ ᎬᏁᏤᎸᎭ ᏱᎰᏩ ᎠᎦᏔᎲ ᎠᏏᏉ ᎾᎩᏲᎱᏒᎾ.

source: 'And now, my son, hearken to my voice, to that which I am commanding thee:
chr: ᎿᏉᏃ ᎠᏇᏥ ᎰᎯᏳᎲᎦ ᏥᏁᎬᎢ, ᎾᏍᎩᏯ ᏄᏍᏛ ᎬᏁᏤᎲᎢ.

source: Go, I pray thee, unto the flock, and take for me from thence two good kids of the goats, and I make them tasteful things for thy father, [such] as he hath loved;
chr: ᎮᎾ ᎠᏫ ᏗᏁᏙᎲᎢ, ᎠᎴ ᎾᎿ ᏫᏗᏍᎩᏯᏅᏏ ᎠᏂᏔᎵ ᎠᏃᏍᏛ ᎠᏫ ᏗᏂᎭᏄᎸᎯ ᎠᏂᎩᎾ. ᎾᏍᎩᏃ ᏓᏥᏯᏛᏅᎢᏍᏔᏁᎵ ᏣᏙᏓ ᎤᎦᎾᏍᏛ ᎠᎵᏍᏓᏴᏗ ᎾᏍᎩ ᏧᎦᎾᏏᎭ;

source: and thou hast taken in to thy father, and he hath eaten, so that his soul doth bless thee before his death.
chr: ᏣᏙᏓᏃ ᏮᏘᏲᎮᎵ, ᎾᏍᎩᏃ ᏛᎵᏍᏓᏴᏂ, ᎾᏍᎩ ᎣᏍᏛ ᏣᏁᏤᏗᏱ ᎠᏏᏉ ᏄᏲᎱᏒᎾ.

source: And Jacob saith unto Rebekah his mother, 'Lo, Esau my brother [is] a hairy man, and I a smooth man,
chr: ᏤᎦᏈᏃ ᎯᎠ ᏄᏪᏎᎴ ᎤᏥ ᎵᏇᎩ, ᎬᏂᏳᏉ ᎥᎩᏂᎵ ᎤᏂᏆᏟ ᎠᏍᎦᏯ ᏥᎩ, ᎠᏴᏃ ᏥᏓᏫᏍᎦᎨ ᏥᏍᎦᏯ;

source: it may be my father doth feel me, and I have been in his eyes as a deceiver, and have brought upon me disesteem, and not a blessing;'
chr: ᎡᏙᏓᎾᏃ ᏯᏆᏒᏂᎵᏙᎸ, ᎠᎴ ᏥᎶᏄᎡᏍᎩᏉ ᏯᎩᏰᎸᏅ; ᎿᏉ ᎥᎩᏍᎦᎢᏍᏗᏉ ᏱᏥᏩᏛᏓ, ᎥᏝᏃ ᎣᏍᏛ ᎥᎩᏁᏤᏗᏱ.

source: and his mother saith to him, 'On me thy disesteem, my son; only hearken to my voice, and go, take for me.'
chr: ᎤᏥᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎠᏇᏥ ᏂᎯ ᎡᏣᏍᎦᎢᏍᏗ ᎨᏒ ᎠᏴ ᎠᎩᎷᏤᎸᎭ, ᎰᎯᏳᎲᎦᏉ ᏥᏁᎬᎢ, ᎠᎴ ᏫᏗᏍᎩᏯᏅᏏ.

source: And he goeth, and taketh, and bringeth to his mother, and his mother maketh tasteful things, [such] as his father hath loved;
chr: ᎤᏪᏅᏎᏃ, ᎠᎴ ᏫᏚᏯᏅᎮᎢ, ᎠᎴ ᎤᏥ ᏚᏘᏃᎮᎴᎢ; ᎤᏥᏃ ᎤᎦᎾᏍᏛ ᎠᎵᏍᏓᏴᏗ ᎤᏛᏅᎢᏍᏔᏁ ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᏙᏓ ᎤᎦᎾᏏᏍᎬᎢ.

source: and Rebekah taketh the desirable garments of Esau her elder son, which [are] with her in the house, and doth put on Jacob her younger son;
chr: ᎵᏇᎩᏃ ᏫᏚᏁᏎ ᏦᏍᏛ ᏗᏄᏬ ᎤᏓᏂᎵᎨ ᎤᏪᏥ ᎢᏐ ᏧᏤᎵᎦ, ᎾᏍᎩ ᎦᎵᏦᏕ ᏚᎾᎥᎢ, ᎠᎴ ᏤᎦᏈ ᎣᏂ ᎡᎯ ᎤᏪᏥ ᏚᏄᏬᎡᎢ.

source: and the skins of the kids of the goats she hath put on his hands, and on the smooth of his neck,
chr: ᎠᏂᎩᎾᏃ ᎠᏫ ᏗᏂᎭᏄᎸᎯ ᏧᏂᏁᎦᎸᏅᎯ ᏚᏪᏰᏑᎳᏁᎢ, ᎠᎴ ᎤᏪᏯᏢᏁ ᏓᏫᏍᎦᎨ ᎨᏒ ᎠᏴᏤᏂ;
